---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.WallFailures.CannotRedoFaceBasedWarn
source: html/9e7ef143-bc12-3b27-e97e-c8fc4976ec2e.htm
---
# Autodesk.Revit.DB.BuiltInFailures.WallFailures.CannotRedoFaceBasedWarn Property

Faces defining this Element cannot be reacquired.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotRedoFaceBasedWarn { get; }
```